MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx550f256l.h
extern volatile __C1FIFOINT1bits_t C1FIFOINT1bits __asm__ ("C1FIFOINT1") __attribute__((section("sfrs"), address(0xBF88B3A0)));
extern volatile uint32_t        C1FIFOINT1CLR __attribute__((section("sfrs"),address(0xBF88B3A4)));
extern volatile uint32_t        C1FIFOINT1SET __attribute__((section("sfrs"),address(0xBF88B3A8)));
extern volatile uint32_t        C1FIFOINT1INV __attribute__((section("sfrs"),address(0xBF88B3AC)));
#define C1FIFOUA1 C1FIFOUA1
extern volatile uint32_t   C1FIFOUA1 __attribute__((section("sfrs"), address(0xBF88B3B0)));
extern volatile uint32_t        C1FIFOUA1CLR __attribute__((section("sfrs"),address(0xBF88B3B4)));
extern volatile uint32_t        C1FIFOUA1SET __attribute__((section("sfrs"),address(0xBF88B3B8)));
extern volatile uint32_t        C1FIFOUA1INV __attribute__((section("sfrs"),address(0xBF88B3BC)));
#define C1FIFOCI1 C1FIFOCI1
extern volatile uint32_t   C1FIFOCI1 __attribute__((section("sfrs"), address(0xBF88B3C0)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI1bits_t;
extern volatile __C1FIFOCI1bits_t C1FIFOCI1bits __asm__ ("C1FIFOCI1") __attribute__((section("sfrs"), address(0xBF88B3C0)));
extern volatile uint32_t        C1FIFOCI1CLR __attribute__((section("sfrs"),address(0xBF88B3C4)));
extern volatile uint32_t        C1FIFOCI1SET __attribute__((section("sfrs"),address(0xBF88B3C8)));
extern volatile uint32_t        C1FIFOCI1INV __attribute__((section("sfrs"),address(0xBF88B3CC)));
#define C1FIFOCON2 C1FIFOCON2
extern volatile uint32_t   C1FIFOCON2 __attribute__((section("sfrs"), address(0xBF88B3D0)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON2bits_t;
extern volatile __C1FIFOCON2bits_t C1FIFOCON2bits __asm__ ("C1FIFOCON2") __attribute__((section("sfrs"), address(0xBF88B3D0)));
extern volatile uint32_t        C1FIFOCON2CLR __attribute__((section("sfrs"),address(0xBF88B3D4)));
extern volatile uint32_t        C1FIFOCON2SET __attribute__((section("sfrs"),address(0xBF88B3D8)));
extern volatile uint32_t        C1FIFOCON2INV __attribute__((section("sfrs"),address(0xBF88B3DC)));
#define C1FIFOINT2 C1FIFOINT2
extern volatile uint32_t   C1FIFOINT2 __attribute__((section("sfrs"), address(0xBF88B3E0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT2bits_t;
extern volatile __C1FIFOINT2bits_t C1FIFOINT2bits __asm__ ("C1FIFOINT2") __attribute__((section("sfrs"), address(0xBF88B3E0)));
extern volatile uint32_t        C1FIFOINT2CLR __attribute__((section("sfrs"),address(0xBF88B3E4)));
extern volatile uint32_t        C1FIFOINT2SET __attribute__((section("sfrs"),address(0xBF88B3E8)));
extern volatile uint32_t        C1FIFOINT2INV __attribute__((section("sfrs"),address(0xBF88B3EC)));
#define C1FIFOUA2 C1FIFOUA2
extern volatile uint32_t   C1FIFOUA2 __attribute__((section("sfrs"), address(0xBF88B3F0)));
extern volatile uint32_t        C1FIFOUA2CLR __attribute__((section("sfrs"),address(0xBF88B3F4)));
extern volatile uint32_t        C1FIFOUA2SET __attribute__((section("sfrs"),address(0xBF88B3F8)));
extern volatile uint32_t        C1FIFOUA2INV __attribute__((section("sfrs"),address(0xBF88B3FC)));
#define C1FIFOCI2 C1FIFOCI2
extern volatile uint32_t   C1FIFOCI2 __attribute__((section("sfrs"), address(0xBF88B400)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI2bits_t;
extern volatile __C1FIFOCI2bits_t C1FIFOCI2bits __asm__ ("C1FIFOCI2") __attribute__((section("sfrs"), address(0xBF88B400)));
extern volatile uint32_t        C1FIFOCI2CLR __attribute__((section("sfrs"),address(0xBF88B404)));
extern volatile uint32_t        C1FIFOCI2SET __attribute__((section("sfrs"),address(0xBF88B408)));
extern volatile uint32_t        C1FIFOCI2INV __attribute__((section("sfrs"),address(0xBF88B40C)));
#define C1FIFOCON3 C1FIFOCON3
extern volatile uint32_t   C1FIFOCON3 __attribute__((section("sfrs"), address(0xBF88B410)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON3bits_t;
extern volatile __C1FIFOCON3bits_t C1FIFOCON3bits __asm__ ("C1FIFOCON3") __attribute__((section("sfrs"), address(0xBF88B410)));
extern volatile uint32_t        C1FIFOCON3CLR __attribute__((section("sfrs"),address(0xBF88B414)));
extern volatile uint32_t        C1FIFOCON3SET __attribute__((section("sfrs"),address(0xBF88B418)));
extern volatile uint32_t        C1FIFOCON3INV __attribute__((section("sfrs"),address(0xBF88B41C)));
#define C1FIFOINT3 C1FIFOINT3
extern volatile uint32_t   C1FIFOINT3 __attribute__((section("sfrs"), address(0xBF88B420)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT3bits_t;
extern volatile __C1FIFOINT3bits_t C1FIFOINT3bits __asm__ ("C1FIFOINT3") __attribute__((section("sfrs"), address(0xBF88B420)));
extern volatile uint32_t        C1FIFOINT3CLR __attribute__((section("sfrs"),address(0xBF88B424)));
extern volatile uint32_t        C1FIFOINT3SET __attribute__((section("sfrs"),address(0xBF88B428)));
extern volatile uint32_t        C1FIFOINT3INV __attribute__((section("sfrs"),address(0xBF88B42C)));
#define C1FIFOUA3 C1FIFOUA3
extern volatile uint32_t   C1FIFOUA3 __attribute__((section("sfrs"), address(0xBF88B430)));
extern volatile uint32_t        C1FIFOUA3CLR __attribute__((section("sfrs"),address(0xBF88B434)));
extern volatile uint32_t        C1FIFOUA3SET __attribute__((section("sfrs"),address(0xBF88B438)));
extern volatile uint32_t        C1FIFOUA3INV __attribute__((section("sfrs"),address(0xBF88B43C)));
#define C1FIFOCI3 C1FIFOCI3
extern volatile uint32_t   C1FIFOCI3 __attribute__((section("sfrs"), address(0xBF88B440)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI3bits_t;
extern volatile __C1FIFOCI3bits_t C1FIFOCI3bits __asm__ ("C1FIFOCI3") __attribute__((section("sfrs"), address(0xBF88B440)));
extern volatile uint32_t        C1FIFOCI3CLR __attribute__((section("sfrs"),address(0xBF88B444)));
extern volatile uint32_t        C1FIFOCI3SET __attribute__((section("sfrs"),address(0xBF88B448)));
extern volatile uint32_t        C1FIFOCI3INV __attribute__((section("sfrs"),address(0xBF88B44C)));
#define C1FIFOCON4 C1FIFOCON4
extern volatile uint32_t   C1FIFOCON4 __attribute__((section("sfrs"), address(0xBF88B450)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON4bits_t;
